#!/usr/bin/python
# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     baiqianbaiji.py
   Description :
   Author :        changyy
   date：          2020/4/10 0010 23:34
-------------------------------------------------
   Change Activity:
                   2020/4/10 0010 23:34
-------------------------------------------------
"""
__author__ = 'changyy'

"""
数学问题，三元一次方程求解。由于只有两个方程式，所以无法通过消元的方法解答，需使用穷举法。
分析:
公鸡 a只  单价5元
母鸡 b只  单价3元
小鸡 c只  单价1/3元
a + b + c = 100
5a + 3b + c/3 = 100 
推导出：
a < 20
b < 33
c = 100 - a - b
"""

for a in range(20):
    for b in range(33):
        c = 100 - a - b
        if 5 * a + 3 * b + c / 3 == 100:
            print('公鸡：%d只，母鸡：%d只，小鸡：%d只' % (a, b, c))
